Revit 2027 API
DividedSurface.GetTileFamilyInstance Method
Get a reference to a tile element associated with a given seed node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstance GetTileFamilyInstance(
	GridNode gridNode,
	int tileIndex
)
Public Function GetTileFamilyInstance (
	gridNode As GridNode,
	tileIndex As Integer
) As FamilyInstance
public:
FamilyInstance^ GetTileFamilyInstance(
	GridNode gridNode,
	int tileIndex
)
member GetTileFamilyInstance :
        gridNode : GridNode *
        tileIndex : int -> FamilyInstance
Parameters
gridNode GridNode
tileIndex Int32
Return Value
FamilyInstance
A FamilyInstance object. Returns null if the ObjectType property is not a FamilySymbol. Returns null if the grid node is not a "seed node", or if the tile is omitted due to boundary conditions.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown if the grid node is outside of the range specified by NumberOfUGridlines and NumberOfVGridlines, or if tileIndex is outside the range [0, TilesPerSeedNode-1].
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace